{"posts":[{"title":"About RNADesign (Always to be continued)","text":"0. 不定更新的前言 其实说是RNA设计问题，但多数内容其实针对整个生物序列设计问题。一些形式上的明确定义是需要的，至少能避免审稿人总是说看不懂Notation 1. RNA设计问题的形式化定义 RNA设计的核心目标是生成满足特定属性（如结构、功能或类型）的RNA序列。形式化表示如下： 给定目标属性c∗（如特定结构、RNA类型或功能），RNA设计的目标是找到一个映射函数f，使得生成的RNA序列S具有目标属性c∗： ∃f:c↦{S∈Σ∗∣S has property c∗} 在实际应用中，通常无法找到完全满足目标属性的序列S，因此引入距离度量D来衡量生成序列与目标属性之间的差异，并重新定义优化目标： minS∈Σ∗D(c,c∗)2. RNA序列的概率分布 RNA序列被表示为核苷酸字符串S={si}i=1L，其中每个核苷酸si∈{A,C,G,U}。序列的概率分布由以下公式给出： P(si|Σ∗)=∑ski=si;Sk∈Σ∗P(Sk|Σ∗)P(Sk|Σ∗)=∏iP(ski|Σ∗)∑Sj∈Σ∗∏iP(sji|Σ∗)最终的优化目标可以表示为： minE[D(c,c∗)]⟺min∑Sk∈Σ∗D(c,c∗)P(Sk|Σ∗)3. 参数化模型与距离度量 我们很容易意识到，设计问题的核心问题是怎么设计一个合适的距离度量。对于概率分布反而并不重要，采用连续性或者离散的方案都挺程式化，这个在后面具体聊可能的结构和实现的时候再讨论。现在先讨论距离度量。 3.1 逆折叠任务 首先比较好的连续性度量是三级结构之间的距离，例如最常见的是RMSD。此时的序列设计任务也是很经典的&quot;逆折叠任务&quot;，此时我们的设计任务被描述成 minSpredRMSD(Struct(Spred),Struct(Starget))问题变得很明确，即怎么获得从序列到结构S↦Struct的映射，在这里我们获得了几个变种： 限制搜索空间，都给我从已知的数据库里搜索，于是问题变成了 minSpred∈ΣRMSD(Struct(Spred),Struct(Starget))where Σ is a known dataset, e.g., PDB这个问题就类似于某种向量搜索了，从不包含target的数据库中搜索结构和它最像的就行。考虑到RNA、DNA满打满算也就几千个结构数据，这个工作只能说至少现在意义不大LMAO 2. 基于结构预测模型，我作为结构预测模型能搜索的空间是无限的！，于是问题变成了 minSpredRMSD(PredStructθ(Spred),Struct(Starget))where PredStructθ is a structure predictor, e.g., AF3好吧，这里则涉及另一个问题，置信度的问题，RNA数据少，10W平方公里的土地上无限的搜索空间也认识不了几个人 3. 第一性原理，序列像就是结构像！好吧，于是这个设计目标就更明确了 minEStarget∈ΣRecovery(Spred,Starget)where Σ contains RNA with similar structure这也是现在最主流的基于三级结构设计序列的模型的训练方式，例如ProteinMPNN，这里的核心问题其实是连续性究竟有没有那么好——这指向另一个很有意思的设计目标，即设计出尽可能偏离已知序列但结构足够相似的序列。此处不作赘述，以后有空就测试 除了三级结构，还有二级结构的逆折叠，在这里我们只讨论RNA的二级结构，这是因为在核酸领域，基于碱基互补配对来定义二级结构的模式有明确的规则（配对方式及热力学参数），这比在蛋白质领域内实则是将三级结构的某些Motif截下作为二级结构的方式要清晰的多。 首先，我们存在一个规则集Ψ，其描述给定的二级结构下，RNA每个部分对折叠自由能的贡献，例如在最近邻模型下 ΔG(Pair(i,j)|S)=ΔG(Pair(i,j)|si−1,sj+1)总之，对于任意给定的核苷酸序列，我们原则上可以获得它所有可能的RNA结构以及对应的热力学能量，即 ΔG(Struct,S|Ψ)那么，多数时候，逆折叠问题显而易见的应该是 minSΔG(Struct,S|Ψ)但在这里存在一个问题，你指定的这个结构，是否是某一个可设计的结构，这个问题有很多定义，例如，这个结构到底是不是某一条序列的最低自由能结构，即 ∀S,∃Struct′≠Struct,ΔG′&lt;ΔG另一个问题则是，对于多条将制定结构作为最小自由能结构的序列，怎么评价哪条序列更优。当然，这个问题目前不做考虑，所有的逆折叠问题都认为你只要找到在指定规则集下能折叠成指定二级结构的序列，就算找到了解。 在这里我们似乎看到了一个清晰的强化学习图景，首先我们先规定一下符号，接下来我们会使用带数字的点括号式来描述二级结构，即 -.i代表第i个核苷酸没有形成互补配对 -(i)j代表第i个核苷酸和第j个核苷酸形成了互补配对 序列也采用类似的方式来定义，即 -[ACGU]i代表第i个核苷酸是[ACGU] 那么我们可以这样进行公式化描述： 结构元素： .i：第i个核苷酸未形成互补配对。 (i)j：第i个和第j个核苷酸形成互补配对。 序列： [ACGU]i：第i个核苷酸为A,C,G,U之一。 集合： E: 所有结构元素集合，包含单点{i}和配对{i,j}。 Eunassigned⊆E: 未分配的结构元素集合。 s: 部分序列，长度为n，未分配位置为占位符 ‘_’。 状态 状态St定义为： St=(Eunassigned,s) Eunassigned: 未分配的结构元素集合，初始为E。 s: 当前部分序列，长度n，其中s[i]∈{A,C,G,U,_}。初始时，s[i]=_，∀i∈{1,…,n}。 Action Action At定义为选择一个未分配元素并分配核苷酸或碱基对： 若选择若选择At={(i,a),若选择 {i}∈Eunassigned,a∈{A,C,G,U}((i,j),(a,b)),若选择 {i,j}∈Eunassigned,(a,b)∈{(A,U),(U,A),(C,G),(G,C),(G,U),(U,G)} 单点：.i↦{Ai,Ci,Gi,Ui}，设置s[i]=a。 配对：(i)j↦{AiUj,UiAj,CiGj,GiCj,GiUj,UiGj}，设置s[i]=a,s[j]=b。 执行后，从Eunassigned移除{i}或{i,j}。 状态转移 给定状态St=(Eunassigned,s)和动作At，下一状态St+1=(Eunassigned′,s′)： 若At=(i,a): s′[i]=a,s′[k]=s[k] for k≠i,Eunassigned′=Eunassigned∖{i} 若At=((i,j),(a,b)): s′[i]=a,s′[j]=b,s′[k]=s[k] for k≠i,j,Eunassigned′=Eunassigned∖{i,j}奖励 奖励函数R(St,At)定义为： 若否则R(St,At)={1−dH(F(s′),ω)n,若 Eunassigned′=∅0,否则 F(s′): 使用折叠预测工具（如 ViennaRNA）计算序列s′的二级结构。 ω: 目标二级结构。 dH: 预测结构与目标结构的汉明距离。 n: 序列长度。 策略 策略π(a|St)为在状态St下选择动作a的概率分布： π:St↦Prob(At∈A)其中A是所有可能动作集合。目标是学习最优策略π∗，最大化期望累积奖励： π∗=arg⁡maxπEπ[∑tR(St,At)]可使用深度强化学习（如 PPO）近似π，输入状态St，输出动作概率。 算法流程 初始化S0=(E,s0)，其中，s0[i]=_，∀i。 在每步t： 基于π选择动作At。 执行动作，更新状态St+1。 计算奖励R(St,At)。 若Eunassigned=∅，终止并评估最终奖励。 使用强化学习算法（如 PPO）更新π，重复直至收敛。","link":"/2025/04/24/RNADesign/"},{"title":"RolePlayAI","text":"","link":"/2025/05/01/RolePlayAI/"},{"title":"胡安","text":"胡安喜欢太阳。 不过胡安不喜欢灯。 他说，这天底下的日光灯，都是挂羊头卖狗肉。他第一次听到日光灯这个词的时候，以为说的是浴室里那四个发着黄光的大热球。心里想着，给自己卧室装四个小太阳也不错，就是有点费电。 结果家里买来一根插电的冰棍，透着砂糖白的光。胡安只觉得这光好冷。不管什么时候，只要打开这管灯，霜白的寒气就充满了整个房间。 有一天胡安用手摸了一下这根冰棍，烫的直叫唤，还吵醒了房间里面的其他人。他们骂了胡安一顿，胡安疼了一个礼拜。 胡安最爱的，是自己房间向南的窗户。那窗户够大，大到胡安终于可以像猫一样，把被褥当做自己的皮毛，蜷缩在明暗之间，看着太阳从脚跟爬上来，依偎在自己的胸口。 金乌怎么能是鸟呢，金乌当然是一只猫。太阳多么像一只猫。胡安最喜欢的动物，就是猫了。何止是喜欢，胡安就想变成一只猫。然后趴在自家阳台的吊篮里面。 ——或许隔壁青儿的卧室也不错。青儿也爱猫，一起蜷在阳光里外，安稳睡上一生懒觉，就挺好的。 房子里的其他人都说胡安没有安全感。只有胡安知道，躺在暗处看着橘黄的光盖在头上，那才叫有安全感。太阳该往东边偏，就往东边偏。窗帘要是拉下来，它就站在窗帘外面。 窗帘真是可靠。胡安心想。不像锁，总是不可靠。日记本的锁总是被打到错的位置，反锁的门总是会走进来那几个人。 后来，胡安换到了其他的房间里面。狭长、阴暗。太阳总是只光顾两步宽的墙，胡安第一次想要买他第二讨厌的东西——镜子。 如果在窗外挂几块大镜子，就能把光送到手边了。多么完美的计划。但胡安依旧讨厌冷冰冰的镜子。这个计划总是被他一遍遍提及，就是没实施过。 冰一样的东西，碎了怎么办。胡安总是这句话收尾。 人们依旧说胡安活得没有安全感。一位最了解胡安的人说，太阳的安全感得靠眼睛来看。另一位最了解胡安的人说，胡安不是喜欢太阳，是贪恋能够晒太阳的大房子。 胡安仍旧越发像猫了。这些振聋发聩的诊断并不能够打扰胡安的好觉。他只在乎哪里能够晒到太阳。 我只想晒太阳。胡安这句话贯彻了整段人生，也是他留下的最后一句话。 以前屋子里的人找到胡安的时候，胡安的双眼死死地盯着太阳，脸上的泪痕有些浮肿。太阳有点大。 胡安火化了。骨灰放在布满了日光灯的小房子里。 人们都说，胡安没有安全感。","link":"/2025/05/26/huzhou01/"},{"title":"莫青","text":"莫道草青青，胡知云安安。 天底下没有这种对联。这是有个晴天胡安送给莫青的。胡安为的就是莫青家的躺椅和那只折耳猫。 莫青不喜欢折耳猫。她总是跟胡安说，这猫生来便是残疾，伴随着病痛降世。她再三阻挠她爸爸买折耳猫，最后她爸爸也答应了她——这只猫是抱养回来的。 胡安总是笑呵呵地应和莫青的话，然后把猫搁在大腿上顺毛。 弓背舒服就弓着背，骨头不好就晒晒太阳，反正累了也喘不过气来，索性就陪我躺这吧。 这话是胡安说的，莫青一直记得。胡安每次说这些，莫青都要翻个白眼。 莫青一家对胡安霸占躺椅上的阳光是不在乎的。除了莫青妈妈有时候会说，胡安那样子，跟莫青姥爷真像。然后大家就都不知道说些什么了——胡安也会变得局促不安。不过他知道这时候莫叔叔会切上一盘水果，让大家吃点，因此仍旧躺着给猫顺毛。 莫青还为此问过胡安，是不是诚心占便宜。 于是胡安写了那幅对联，说是正式上门，求这躺椅的使用权。 莫青收了对联，管叫胡安姥爷越发勤了。 莫青喜欢美的东西——除了打扮自己。她喜欢弹吉他哼歌，有时拿张纸出来画个画，又或者俯卧在沙发上看书。她家书多，大小也适中，弹吉他声音刚好。唯独不爱的，就是像胡安一样，躺在躺椅上晒太阳，躺椅一直在晃，可胡安看起来却好像一动不动。 她觉得这样是美好的。她甚至为此画过两张画像拍了一张照。但是她自己是体验不了。躺上三五分钟就好像过去了一整天，什么做了的没做的想做的事情全部涌入脑海了。 她还不信邪。让胡安坐板凳上，自己躺躺椅。然而挣扎了一个小时之后，不仅感觉心烦意乱，而且还被回来的莫叔叔抓了个正着，批了几句。 为什么胡安可以躺在躺椅上坐一个白天，我一下子都受不了呢？我觉得我心很静，也没有那么多烦恼啊？ 莫青是这么想的，也是这么问她爸爸的。 安子那是懂事了。莫太太这么说。 胡安心烦，动不了。莫叔叔这么说。 上课还讲小话传纸条呢，骂起人来又绕又毒，懂什么事啊。莫青心里嘀咕。 有一个学期，胡安每天中午就在莫家待着，午休片刻就和莫青去学校。 莫青心里是有些埋怨的。她听说爸爸工作升职机会没抓住，也看新闻知道经济环境不太好。这时候胡安还来捣乱。 有一天，莫青生气了。 她回家的时候，看见爸爸坐在沙发上，手边放着两罐空啤酒。 莫叔叔，胡安敬你一杯。胡安躺在躺椅上，一边开着啤酒一边敬莫叔叔。 胡安，这是我家，请你出去。 喝完这口，莫叔叔，我干了，这就走。胡安没说完，被莫青拖了出去。 莫青生气地摔了门，然后听到楼梯间里扔啤酒罐的空响，更生气了。 然后深吸了两口气，又转过头来，劝面色铁青的爸爸不要生胡安的气。 莫青真的吓到了，工作安排结果出来的那天，自己爸爸脸色都没有这么难看过。现在更是一句话不说。 混蛋胡安。 然后莫青这学期再也没有理胡安，也不再跟胡安一起去学校。 胡安总是晚些走，赶在上课的点到学校。 学期结束后的寒假，莫家没有等到晒太阳的胡安，莫叔叔说，胡安回老家过年了。 那年很多人来胡家拜年，都没成功。 快毕业时，莫青开始了一场恋爱。莫爸爸是知道的，可莫爸爸也没办法。到这个年龄了，想这些事情谁也拦不住。莫爸爸也愁，莫妈妈倒是蒙在鼓里。 那天莫爸爸过来找了胡安，说了些话，莫青也不知道莫爸爸和胡安说了些什么。 毕业那天，莫青和她的小男朋友，收到了胡安发来的短信。 三清可证，大人满堂；既非良缘，是名良缘。 ——胡安贺上。 莫青很生气，说胡安咒他俩。莫青的男朋友也很生气，打电话骂了胡安一顿。 过了两个月零一个学期，他们分手了。莫青很难过，也很沮丧，想起胡安的话，悲怒交加。然而毕业第二天，胡安就搬家了。新家在哪里，无从得知。那次生气之后删了胡安所有联系方式，现在一个也联系不上了。 莫爸爸安慰了莫青。莫青抱着爸爸哭了整宿。 后来莫青学业日渐繁重。身边的女孩子有的爱上了打扮，有的如她，干净整洁便足够。也不再有男孩子找她，她也不想谈什么恋爱。做做题，读读书，日子如流水般度过。 等到了大学，无非成了，做做题，读读书，弹弹吉他，后来一年又去实习了些日子。 然后就工作去了。 莫青的工作充实却不繁重，每天的日子重复却也有些新意。 莫青交了个男朋友，哪里想到是个骗子。骗心骗钱骗了时间，然后一拍两散。 莫青便又想起胡安来。都是他咒的。 可是胡安再也不会联系她了。 她又哭了一宿，这次是抱着抱枕。 过了两年，便又谈了一个男朋友。独立、阳光、对她很依赖，就像是胡安腿上的折耳猫。 莫太太为此抱怨过两回，老莫却很高兴，说女儿终于幸福了。 婚礼前夜，莫青从老莫手上拿到一张有点发黄的信封，没有拆封。 空空无无，莫叔叔要我帮你。可我不渡人，莫不如自渡。既然你爱情美满，莫叔叔觉得你婚姻将会幸福，那姥爷劝上一句，再贺上一句： 日后的生活，应无所住，而生其心。 如来说良缘，既非良缘，是名良缘。 ——胡安贺上。 另外，如果莫叔叔没有拆封，你就跟他说，我没白敬酒，他也是个浪漫的人。 莫青把信给了老莫，老莫看了两眼，哈哈大笑。 应该请他喝上两杯，好好给他道个歉的。莫青有一天说。 你姥爷用不上这些。老莫躺在躺椅上笑了。 莫青并不知道，胡安死前，给老莫留了第二封信。","link":"/2025/05/26/huzhou02/"},{"title":"老白","text":"“白大爷！欢子给你写信来了！” “哦哦，写的什么啊？”白大爷笑呵呵地接过信来，慢慢揭开信封，嘴中还在嘀咕，“这小子，老家伙我怎么读得了信啊，呵呵。” 一件洗得发白的蓝色工作服，一脸雪白绵软的大胡子，一头茂密的白发，白爷爷，时间在您这里，好像走到了终点。您的皱纹，您的白发，您的白胡子，您的旧衣服，分明是时间在向我示威，在展示它那无与伦比的力量——可是二十年来，我不曾见过您的皱纹增多，不曾见过您的头发稀疏，不曾见过您的胡子剃短，更不曾见过您换掉那件工作服。 您就好像横渡了时间的长河，那时光并没把您冲刷进无尽的远洋里，反而是您登上了彼岸，看到谁往下游走，就跟着看两眼。而我恰巧是最不爱游泳的人，一心想着躺在河岸边。这才有幸在流水般的记忆里，找到您这个锚点。 跟老人家说话本来不该这么文绉绉的，何况您还是个门卫呢？可是我还是忍不住这样扯上一些似是而非的话。我知道您听得懂，您一定听得懂。二十年来的默契我今天想悄悄捅破。白爷爷，您那一手毛笔字，我除了贴在门口的福字，俨然想不起您写过什么。可是只要我想起来，就好像体会到了无穷无尽的书法道理。更别提您那本翻烂了的红宝书。说您不识字，说您不懂文学，实在是胡扯——尽管那十多年，我们一直保持这样的默契。 您总是夸我懂事，其实那些日子我并不懂事。不然我就不会在被批评不懂事的时候，想着您的夸奖，每想一遍，就更委屈一点——我最早只是喜欢您那里安宁的氛围。诚如我开头所说，您那里就是时间的终结。我讨厌束缚，您知道的。我躺着不动，只是为了不去触碰随处可见的障壁。而在您那里，时间就不再能够束缚我们。我哼着小曲，您写着对联，一切无因无果，乐得自在。 当然我不负您的期望，后来的日子里我确实是懂事了。我相信您看得出来。只是自那以后，我也开始在时间长河里挣扎求生。原来我总是横渡其间，找到机会就要定在河岸上休息片刻，然而后来也要蚍蜉撼树，逆流而上。从此再也没有回过您的身边。可是人力有时穷，我是明白这个道理的。 白爷爷，我被生活的巨浪裹挟着颠簸，什么汹涌波涛，什么风雨雷电，变幻无常，不过是梦幻泡影。唯一的真就是与您相伴的时光。小子狂妄，想要寻真，想要避开一切无常——只是这个时代被您那一代人开拓成了通天大江，我实在是无能横渡了。只好化作江底顽石，深扎河床，镇守暗流，远离浪潮。 您也不要为欢子担忧。欢子这封信到了您的手上，就说明欢子我啊，已经走到了时间的终结。只是可惜束缚太多，从此不能与你们相见了。 “唉，欢子你就是回来了，我老白还不能让你踏实过日子吗？” 我知道您要这样说的。白爷爷，我甚至知道您是有说这个话的底气的。虽然莫姥爷在我出生前就走了，可我到底还是知道了您不少事。我也清楚您是老革命，要保我，也是毫无问题。 可是白爷爷，我处在长河里，我不能一把把上岸的您给拉进来了。小子自有主意，现在就挺好，说句不该说的话，这封信给了您，我肯定是不在了，您也肯定知道小子不在了。我只求落叶归根，想来是死在家中。您的身份啊，用去催邮局吧。我遗嘱里给你和莫家三口人留了不止这一封信，只是不同时刻来送罢了。比如这次就是小青要结婚了，莫家的小青哈。 白爷爷，你啊，再怎么嫌青子闹腾，老战友的外孙女你是不会不在乎的，我都清楚。 我也不知道那年为什么你不愿意给青子讲我的贺词。可能是青子任性没有跟你说吧。 还得麻烦您，代我为青子小两口证婚，有空的话，给他们讲讲经。 嗯，后面两张信纸是给莫叔叔的，您看要不要他给您念吧。 欢子呈上","link":"/2025/05/26/huzhou03/"},{"title":"胡青","text":"胡青第一天见到胡安的时候，还不叫这个名字。 胡安穿了件绿色的T裇，配了条灰色的长裤，躺在李院长旁边的，在胡青眼里，就像是孤儿院墙上密密麻麻的爬山虎。 胡安正在跟李院长闲谈，胡青便兀自走过来，跟李院长说： “他。” 李院长还没来得及反应过来。胡安就笑了。 “我才十六，看你小我不了几岁。不成不成。” 胡青继续盯着李院长，“院长，我想要认他的爸妈做监护人。” “你这小子，满嘴胡沁，小欢父母有了小欢，怎么可能还收养你？” “李伯，喝口茶吧。” 胡安递了一杯茶给李院长，揉了揉胡青的头发。 “我叫胡安，你叫什么啊？” “我没有名字，大哥你给我起一个吧。” “哈哈哈，李院长说的不错。那我就叫你胡青了。” 胡青点了点头，“那我就叫胡青了。大哥再见。” 后来几年，胡青偶尔能够看见胡安来孤儿院。从来都是晴朗的周末下午，胡安就会找李院长喝茶。胡青便每次赶来胡安旁边，学着胡安的样子，不说不喝，只是躺在躺椅里看着胡安。 “小青，还是少来这里晒太阳，越晒越冷。” “……” 胡安便摇头，继续陪李院长聊天。 孤儿院里的孩子们都很喜欢李院长，但是却不敢靠近胡安，除了胡青。因此孤儿院里的孩子们也不再靠近胡青。 直到有一天，胡安提了一把黑伞过来找李院长，胡青又来寻胡安。胡安这次不再陪着李院长躺着了。 “小青，你学我也行，只是你完全踏不上绝路。因此我俩终究有天会分别。今天也好，明天也好。以后我也不会来了。老李不送我，你也别送我。就这样吧。” 胡青点了点头。 一个月后，胡青去了君子城游学，给胡安发了封邮件。 胡安没有回信。不过胡青总能从胡安的朋友那里听到胡安跟他说的话。 直到胡青收到了胡安寄来的信，那天他已经离开了君子城，走到不知道哪里去了。 胡青说君子如熏华草，朝生夕死。 他当不得君子，就也没去送胡安一程。","link":"/2025/05/27/huzhou04/"},{"title":"RNA序列设计方法","text":"大纲、目录 大纲、目录 0. 前言 1. 中英文摘要 2. 背景综述 2.1 RNA计算设计任务 2.2 RNA计算设计方法及常见优化目标 2.2.1 代表性RNA设计方法 2.3 目前RNA计算设计方法的问题和缺陷 3. 研究目标 4. 实验设计及方法 4.1 RNA设计任务的分类与公式化描述 4.2 RNACG - 条件生成视角下的RNA序列设计框架 4.2.1 训练目标 4.2.2 模型结构设计 序列生成主模块 三级结构条件编码器 多类型条件的融合方式 4.3 RNA三级结构特征的构建 4.3.1 RNA主链二面角定义及其建模意义 4.3.2 节点特征：残基级几何与物理属性 （1）亲水/疏水位点分布 （2）原子堆叠密度 （3）糖环平面性 4.3.3 边特征：碱基间相互作用建模 （1）经典距离特征 （2）糖环法向量夹角 （3）Leontis-Westhof体系下的Sugar Edge方向角 4.3.4 子图特征：局部结构motif建模 （1）滑动窗内的骨架方向一致性 （2）滑动窗内的碱基堆叠一致性 （3）局部螺旋参数 4.3.5 特征处理流程 5. 进一步研究计划 5.1 更广泛的RNA特征工程 5.2 更全面的条件引导生成 0. 前言 本篇部分承接RNADesign部分，核心是博主博资考书面报告部分内容的撰写。反正总要先写草稿，干脆写个博客。把不敏感的内容公布就是了。 1. 中英文摘要 待写 最不想写的就是这玩意儿。等我正文写完再说。 2. 背景综述 RNA作为连接DNA与蛋白质之间信息传递的重要分子，在转录调控、转运过程、催化反应等多种生物过程中发挥着关键作用。近年来，随着合成生物学、结构生物学和计算生物学的发展，RNA工程已成为推动基因编辑、疾病治疗及功能研究的重要工具。因此，发展高效、精准的RNA计算设计方法，具有重要的理论价值和广泛的应用前景。 本章旨在系统梳理RNA计算设计的基本任务、代表性方法及其优化目标，并分析当前主流方法所面临的主要挑战与局限性，为后续提出新的RNA序列设计框架提供理论依据与问题导向。 2.1 RNA计算设计任务 RNA计算设计的核心目标是：根据特定功能需求或结构特征，反向推导出满足条件的RNA序列 。现有的RNA计算设计任务，通常面对以下任务中的一种或几种： 结构驱动型设计 ：即设计能够折叠成指定二级或三级结构的RNA序列。该任务基于“结构决定功能”的假设，例如核糖适配体的设计通常依赖于特定结合口袋的形成； 序列特异性设计 ：即设计具有特定序列特征的RNA，如互补序列、限制性酶切位点等。这类任务常用于siRNA、gRNA的设计，强调序列匹配与脱靶控制； 属性优化型设计 ：即在满足结构或序列约束的前提下，对某些物理化学性质进行优化，例如最小自由能（MFE）、密码子偏好性、翻译效率等。 绝大多数的RNA设计任务都可以视作以上任务的综合，以茶碱调控型核糖开关为例，研究人员综合考虑了适配体结构的稳定性、开关结构的转换自由能差值以及序列的热力学特性，从而设计出性能更优的响应元件。类似地，mRNA疫苗设计中也需同时优化密码子使用、结构稳定性和翻译效率。 在接下来的小节中，我们将系统回顾现有RNA计算设计方法的发展现状，并对其适用范围与局限性进行分析。 2.2 RNA计算设计方法及常见优化目标 RNA计算设计方法的发展经历了从经验规则驱动到数据驱动、再到深度学习建模的演进过程。根据设计目标和策略的不同，现有的方法可分为以下几类： 结构驱动型设计方法 此类方法主要面向RNA二级或三级结构的设计任务。早期方法多采用启发式搜索或片段组装策略，如FARFAR2通过生成局部结构片段并进行拼接来构建全RNA结构。近年来，随着RhoFold、RosettafoldNA、DRFold等高精度RNA结构预测模型的发展，基于结构的逆折叠方法（如RDesign、Ribodiffusion）开始兴起。这些方法直接从目标结构出发，生成与之匹配的RNA序列。 此类方法的优化目标通常包括： 设计序列的预测结构与目标结构之间的相似性； 在给定骨架坐标下，生成序列与原始序列的相似度（如“序列回复率”）； 确保生成序列在热力学上具有较高的折叠稳定性。 序列驱动型设计方法 对于短RNA（如siRNA、miRNA、gRNA）的设计任务，序列特异性成为核心关注点。此类方法通常基于碱基配对规则、脱靶效应评估模型等，优化目标包括： 最小化脱靶风险； 控制碱基频率分布； 避免重复序列或不稳定结构区域。 这类设计在RNAi、CRISPR-Cas系统等领域已实现高度自动化和商业化，面对不同任务甚至会有完备的高通量筛选后的文库 功能驱动型设计方法 部分RNA设计任务聚焦于功能性属性的优化，例如mRNA的翻译效率、UTR区域的调控能力等。这类方法通常依赖于序列属性预测模型，通过优化目标函数指导序列生成。例如： LinearDesign 方法在密码子选择和结构稳定性的双重约束下，快速搜索最优mRNA序列； UTR-LM 则借助语言模型预训练技术，微调后用于预测和优化UTR区域的功能表现。 此类任务仍面临数据稀缺和模型泛化能力不足的问题，尤其在生成式模型方面尚处于探索阶段。 家族特异性设计方法 协方差模型（Covariance Model, CM）是RNA家族建模的经典方法，广泛应用于Rfam数据库中的RNA分类与注释。CM不仅建模序列保守性，还捕捉二级结构信息，能够有效识别RNA家族成员。基于CM的RNA设计方法通常通过采样生成符合该模型的序列，以保持家族特异性 2.2.1 代表性RNA设计方法 对于半经验的设计方法，例如针对CRISPR的guide RNA设计，都有成熟的文库和商业化方案。在这里不再赘述。在这里主要介绍具有代表性的计算方法。 LinearDesign: 通过构建密码子规则和二级结构折叠规则约束下的语法树，加速对mRNA序列的优化和搜索； RfamGen: 借助VAE模型重构协方差模型中马尔科夫链之间的转移和发射概率，从而寻找更新颖的特定家族的RNA； RhoDesign: 借助Rhofold预测的大量高置信度的计算结构训练RNA逆折叠模型，然后针对特定的核酸适配体结构设计序列； UTR-LM: 借助大量的未标注数据训练了UTR区域序列的语言模型，并根据特定任务的实验数据微调下游模块，利用训练好的性质预测模块搜索具有目标特性的RNA序列 此外，还有大量基于搜索算法（如遗传算法、蒙特卡洛模拟）的传统方法仍在使用，尤其是在缺乏高质量生成模型的情况下。 2.3 目前RNA计算设计方法的问题和缺陷 尽管RNA计算设计方法在多个方向取得了进展，但仍存在若干亟待解决的关键问题： 序列空间过大导致搜索效率低下 RNA序列长度通常在几十至几千个核苷酸之间，其潜在序列空间呈指数级增长，使得穷举搜索不可行。即便引入结构或序列约束，搜索效率依然受限。尤其在二级结构逆折叠任务中，如何高效筛选出既能折叠为目标结构、又能满足其他功能约束的序列仍是难题。 注释数据与评估工具匮乏 高质量的RNA结构、功能和动力学数据相对稀缺，严重制约了深度学习模型的训练与验证。例如，在三级结构设计中，由于缺乏类似于AlphaFold的高性能预测工具，“序列回复率”仍是主流评估指标，难以反映真实功能表现。 生成模型发展滞后 与蛋白质领域相比，RNA领域的生成模型尚处于初级阶段。虽然已有部分工作尝试引入VAE、扩散模型等生成架构（如RfamGen、Ribodiffusion），但整体来看，尚未出现类似ESM-IF或ProGen级别的通用生成模型。这限制了RNA设计从“筛选+验证”向“端到端生成”的范式转变。 特征工程挖掘不足 RNA设计涉及复杂的序列-结构-功能关系，但目前的方法往往忽视了对关键特征的系统提取与建模。例如，RNA与蛋白质互作时，其结构偏好性可能与单体RNA存在差异；而在复合物环境中，RNA的结构分布也受到外部条件的影响。这些因素尚未被充分纳入特征工程中，导致模型预测偏差较大。 缺乏对动力学过程的建模 RNA在体内折叠并非静态过程，而是伴随转录进行的动态变化。共转录折叠（cotranscriptional folding）已被实验证实对RNA功能至关重要，但目前绝大多数设计方法仍基于静态结构假设。尽管已有少数工具尝试建模折叠路径和能量势垒，但整体而言，动力学约束仍未被系统整合进RNA设计流程中。 3. 研究目标 RNA计算设计旨在根据特定功能或结构需求，反向生成满足条件的RNA序列。当前方法在任务建模统一性、三级结构特征挖掘及动力学过程建模方面仍存在明显不足。针对这些问题，本研究提出以下两个核心目标： 构建统一的RNA设计任务描述框架与生成式模型 现有RNA设计任务形式多样，包括结构驱动型、功能优化型和家族特异性等，但缺乏统一的任务建模方式，限制了模型的泛化能力与多目标优化潜力。为此，本研究拟建立一个通用的任务描述体系，将不同设计目标形式化为可联合建模的输入条件，并基于此构建端到端的深度生成模型。 该模型应具备： 多模态输入支持（如结构、功能属性、家族信息）； 多目标联合优化能力； 可解释性接口，便于分析关键特征对生成结果的影响。 最终目标是实现一个适用于多种RNA设计场景的通用生成平台。 完善基于RNA三级结构的特征工程与解释性建模 目前RNA设计中对三级结构的利用尚不充分，特征表示粗糙，缺乏对motif识别与家族聚类的有效建模。为此，本研究将进一步探索： 更具表达能力的三级结构特征提取方法； 基于结构的功能motif识别与注释； 利用结构特征进行RNA家族划分与聚类分析。 通过上述工作，提升模型对RNA结构-功能关系的理解能力，增强设计结果的生物学合理性。 此外，本研究会在生成模型的过程中，探索基于动力学的生成控制机制，RNA在细胞内的折叠是一个动态过程，受到共转录折叠等机制影响。然而，现有设计方法普遍忽略动力学因素。因此，本研究还将初步尝试在生成过程中引入动力学建模，探索更加贴近生物现实的序列生成策略。 4. 实验设计及方法 4.1 RNA设计任务的分类与公式化描述 如前所述（见2.1节），RNA计算设计任务可根据其核心目标划分为以下三类： 基于三级结构的设计：生成能够折叠为目标三维结构的RNA序列； 基于序列特异性的设计：满足特定序列模式或家族特异性要求； 基于性质优化的设计：在给定约束下最大化或最小化某些理化或功能属性（如翻译效率、折叠自由能等）。 上述任务可统一形式化为如下优化问题： 给定目标条件C（如目标结构、功能属性或家族特征）与序列约束集合Σ，寻找一条RNA序列S={si}，其中si∈{A,C,G,U}，使得该序列在所定义的目标空间中与C尽可能匹配： argminS∈Σ⁡D(C(S),C)其中： C(S)表示由序列S推导出的目标属性（例如预测结构、理化性质等）； D(⋅,⋅)是衡量目标匹配程度的距离函数，具体形式依据任务类型而定： 对于结构设计任务，D可采用 RMSD 或 TM-score（此时定义为1−TM-score）； 对于性质优化任务，可直接定义为最大化或最小化目标函数C(S)。 该形式化建模为后续构建通用RNA设计框架提供了理论基础。 4.2 RNACG - 条件生成视角下的RNA序列设计框架 4.2.1 训练目标 如4.1节所描述，RNA序列设计可被看做在给定条件引导下的序列生成任务，即 arg⁡minθESinit∈Σlog⁡P(fθ(Sinit|C)|C)其中P(S|C)表示真实情况的条件概率，fθ(Sinit|C)是模型在条件引导下生成的样本。为了使得模型的可微分性，我们选择使用连续的碱基概率来表述最后的序列概率 P(S|fθ(Sinit|C)):=∏iP(si|fθ(Sinit|C))考虑到真实世界的样本数据都是离散序列的分布，我们最后可以把序列条件生成任务描述为最大化在给定条件C下观测到真实序列S的对数似然： L(θ)=ES∼Pdata,C[log⁡P(S|C;θ)]其中Pdata表示经验数据分布，θ是模型参数。 4.2.2 模型结构设计 如第2节所述，RNA设计任务通常需要综合考虑多种类型的输入条件信息，包括但不限于：结构信息、语义信息、类别信息以及理化性质等。这些条件在控制序列生成时具有不同的粒度层级：某些信息（如三级结构）作用于残基级别，而另一些信息（如家族分类或折叠自由能）则对整体拓扑结构施加影响。因此，模型结构应具备同时处理微观与宏观控制的能力。 此外，RNA序列本身包含丰富的语义信息，其作为条件的一部分也应在生成过程中被合理建模。基于上述分析，我们提出了一种模块化架构：由可插拔的残基级条件编码器与支持分类器引导的序列生成主模块组成，分别负责局部结构信息的嵌入与全局语义的调控。 序列生成主模块 序列生成主模块采用 Diffusion Transformer （DiT）结构实现，该结构通过引入扩散过程增强了传统Transformer在复杂分布建模中的能力，从而更有效地应对RNA序列空间的高维性与多样性。具体而言，序列生成过程可以表示为一个从噪声分布逐步去噪至目标序列的过程： pθ(x0:T)=p(xT)∏t=1Tpθ(xt−1∣xt)其中xt表示第t步的序列状态，x0是目标RNA序列，xT是完全噪声化的初始状态；p(xT)为先验噪声分布，pθ(⋅|⋅)表示参数化的时间步转移概率。 为了在生成过程中融合外部条件信息，我们将 Diffusion Transformer 的每一层扩展为条件引导形式，即在每一步预测中引入残差级别的条件向量ci∈Rd，最终输出如下所示： h(l)=DiT(l)(h(l−1),{ci}i=1N)其中h(l)表示第l层的隐状态，N为序列长度，DiT(l)Diffusion Transformer 第l层。 受到D3PM和Discrete Flow Matching的启发，我们将模型的训练目标设置为 arg⁡minθL(θ);L(θ)=CE(DiT(St|C),S0)St∼S0⋅(1−t)+S1⋅t三级结构条件编码器 对于结构相关的残基级条件输入，我们设计了一个基于 Message Passing Neural Network (MPNN) 的条件编码器，用于将三维结构信息映射为可用于序列生成的隐向量表示。 给定一个RNA分子的三级结构χ，将其建模为图结构G=(V,E)，其中节点集合V对应每个残基，边集合E基于K近邻策略构建。每个节点i的特征fV(χi)包括其几何坐标、键角、二面角等局部结构信息，边(i,j)的特征fE(χij)则包括两残基之间的距离、方向张量等相对结构信息。 经过MPNN编码后，节点与边的隐表示分别为： hV,hE=MPNN(fV(χ),fE(χ))其中fV(χ)={fV(χi)}i=1N，fE(χ)={fE(χij)}(i,j)∈E分别表示所有节点与边的原始结构特征，hV,hE为对应的隐层表示。这些表示将与主模块的序列状态进行拼接或注意力交互，以实现结构感知的序列生成。 多类型条件的融合方式 针对不同类型的残基级条件输入，我们提供了灵活的编码接口。例如，对于家族分类信息，既可以通过词表嵌入直接为每个位置分配对应类别的向量，也可以通过全局分类器进行梯度引导，辅助主模块在生成过程中保持语义一致性。详细的融合策略将在后续实验部分展开讨论。 4.3 RNA三级结构特征的构建 RNA分子的三维结构是其功能实现的基础，而其中的骨架几何构象则决定了RNA的局部柔性与全局稳定性。作为最经典的拓扑学结论之一，RNA主链可以被描述为由七个关键二面角（dihedral angles）所定义，这些角度共同刻画了RNA骨架的空间走向，并在RNA折叠、结构预测与设计中具有重要意义。 4.3.1 RNA主链二面角定义及其建模意义 RNA主链的七个主要二面角通常用希腊字母表示，分别为：α、β、γ、δ、ϵ、ζ和χ。它们分别对应于以下原子排列所形成的平面之间的夹角： α:O3,i−1′−Pi−O5,i′−C5,i′ β:Pi−O5,i′−C5,i′−C4,i′ γ:O5,i′−C5,i′−C4,i′−C3,i′ δ:C5,i′−C4,i′−C3,i′−O3,i′ ϵ:C4,i′−C3,i′−O3,i′−Pi+1 ζ:C3,i′−O3,i′−Pi+1−O5,i+1′ χ: 对于嘧啶类碱基（如U、C）：O4′−C1′−N1−C2；对于嘌呤类碱基（如A、G）：O4′−C1′−N9−C4 这些二面角构成了RNA骨架构象的基本单元，能够反映RNA主链的局部构象偏好。我们使用以下方法计算任意一组四个连续原子A−B−C−D所构成的二面角： ϕ=atan2((AB→×BC→)⋅(BC→×CD→),|BC→|⋅(AB→⋅(BC→×CD→)))其中： AB→=xB−xA， BC→=xC−xB， CD→=xD−xC。 我们将这六个主链相关的二面角（α至ζ）作为节点特征输入模型，以增强对RNA骨架稳定性的建模能力。 需要注意的是，χ角度虽然也属于RNA结构的重要组成部分，但因其与碱基类型高度相关，在大多数情况下已隐含在序列信息中，因此在本工作中我们谨慎使用该角度，仅将其作为辅助特征进行探索性实验。 4.3.2 节点特征：残基级几何与物理属性 除了骨架二面角外，RNA的功能和结构稳定性还与其局部几何与物理性质密切相关。我们提取以下几类节点特征来进一步丰富模型对RNA结构的理解： （1）亲水/疏水位点分布 我们通过计算每个残基周围特定距离范围内水分子密度或氢键形成能力，构建亲水性特征向量： hihydro=1|N(i)|∑j∈N(i)wj⋅log⁡(1dij)其中N(i)表示残基i周围水分子集合，dij为其与水分子j的距离，wj是基于氢键供受体类型的权重系数。 （2）原子堆叠密度 我们定义一个滑动窗口W(i)，统计窗口内相邻碱基之间的平均堆叠能量： sistack=1|W(i)|−1∑j∈W(i),j≠iexp⁡(−|vi−vj|2σ2)其中vi表示碱基i的方向向量，σ为高斯核宽度参数。 （3）糖环平面性 糖环是否保持平面状态直接影响RNA的构象稳定性。我们计算每个残基糖环四个关键原子（C5’, C4’, O5’, C3’）构成的平面偏离程度： pisugar=|n⋅(xC3′−xC5′)||n|其中n=(xC4′−xC5′)×(xO5′−xC5′)为糖环所在平面的法向量。 4.3.3 边特征：碱基间相互作用建模 RNA的三级结构依赖于碱基间的非共价相互作用，包括氢键、堆叠、范德华力等。在图结构建模中，这些关系通过边特征进行表达。除传统逆折叠模型中常用的几种原子间距离特征外（如下），我们还引入了更具生物解释性的几何特征： （1）经典距离特征 D(Pi,Pj)=|xPi−xPj| D(C3,i′,C3,j′)=|xC3i′−xC3j′| D(N1/9,i,N1/9,j)=|xNi−xNj| （2）糖环法向量夹角 我们计算两个相连或配对残基糖环平面的法向量夹角： θijsugar=arccos⁡(ni⋅nj|ni||nj|)其中ni、nj分别为残基i、j的糖环平面法向量。 （3）Leontis-Westhof体系下的Sugar Edge方向角 我们定义两个碱基Sugar Edge的方向向量ui、uj，并计算其夹角： θijedge=arccos⁡(ui⋅uj|ui||uj|)用于捕捉非标准配对模式的信息。 4.3.4 子图特征：局部结构motif建模 RNA结构中广泛存在保守的二级与三级结构motif，例如发卡环、假结、螺旋区段等。为了使模型具备识别并利用这些motif的能力，我们从多个尺度提取子图特征： （1）滑动窗内的骨架方向一致性 我们沿RNA主链设置滑动窗口W(i)，计算窗口内所有P-P向量的方向一致性： cidir=1|W(i)|(|W(i)|−1)∑j,k∈W(i),j≠kvj⋅vk其中vj=normalize(xPj+1−xPj) （2）滑动窗内的碱基堆叠一致性 类似地，我们计算滑动窗口内相邻碱基之间堆叠方向的一致性： sicons=1|W(i)|−1∑j∈W(i),j≠icos⁡(θij)其中θij为碱基i与j的堆叠方向夹角。 （3）局部螺旋参数 包括局部上升梯度（rise）和旋转角度（twist）： ri=(xC4i′−xC4i−1′)⋅niti=arccos⁡(ni⋅ni+1|ni||ni+1|)其中ni为第i个碱基平面的法向量。 4.3.5 特征处理流程 为确保模型能有效利用上述特征，我们设计了以下特征提取与预处理流程： 图构建：基于K近邻算法将RNA结构建模为图，节点代表残基，边代表空间接近的残基。 特征提取：依据原子坐标逐项计算上述节点、边及子图层级特征。 缺失值处理：对缺失坐标的原子采用零填充策略，避免数据丢失。 数值稳定性处理：对角度类特征进行归一化，对距离类特征进行裁剪（clipping），防止异常值干扰训练过程。 特征融合：将提取的多维特征拼接后输入MPNN编码器，生成条件向量供后续生成模块使用。 5. 进一步研究计划 5.1 更广泛的RNA特征工程 5.2中的特征可以看出，尽管边特征很重要，但对边特征的使用却很简单。这也是xgboost弱于使用基于神经网络方法的地方。我们计划能够更好地编码包括边特征在内的子图特征，这将揭示更多明确的motif。例如，考虑RNA的二级结构（不考虑假结），受到Infernal启发，我们可以将二级结构归纳为由helix和multiloop节点组成的二叉树。在协方差模型中，multiloop会引入一个树的分裂节点，然后将stack/buldge/internal loop等结构视作base-pair/insert/delete等节点的串联。在这里，我们进一步将串联的全部stack/buldge/internal loop视作一个节点，只要两个串联的结构中没有multiloop引入的分支。 5.2 更全面的条件引导生成 目前的生成任务仅有三级结构逆折叠和家族特异性序列生成，对于二级结构逆折叠、某些特殊的功能性RNA生成（例如toehold）之类的结构生成都值得进一步研究。同时整合多种信息方面也需要尝试，例如使用Rfam.pdb注释的三级结构信息和家族信息引导生成。此外，考虑到flow matching方法的特性，基于类似共转录折叠的动力学机制控制模型的生成和采样路径也是值得探索的方向。","link":"/2025/05/13/phdqfy/"},{"title":"克莱","text":"在大海的另一头，有一座彼岸城。 彼岸城有一种花，叫做彼岸花。跟这个烂俗的名字一样，它拥有一个同样烂俗的传说。 传说吃下彼岸花，就可以返老还童，重新回到自己的童年。而彼岸花，掌握在彼特先生手上。 彼特先生住在孩儿巷，孩儿巷里的小孩子们总是会听见巷子外面的人说，他们是吃下了彼特先生的彼岸花，重获新生的人。据说，他们当年都是在海的对面赫赫有名的勇者或者学者，漂洋过海来到彼岸城寻求新生。 在新生的人生里，有些人找回了曾经的风云岁月。大海盗杰克船长，大银行家约翰行长，还有大贤者安妮女士，都是从孩儿巷里走出来的。当然，也有一些人总是走不出孩儿巷。对于这些人，彼特先生便一次又一次的让他们返老还童。 而克莱——彼特先生的侄子——就是其中一个人。 克莱是整个大陆，除了最博学的历史学家之外，唯一一个知道彼特先生年龄的人——连彼特先生都记不清自己的年龄了。他跟随着正当壮年的彼特先生，跨越了整片大陆和海洋，来到了当时还没有彼岸城的岛屿上，从此和彼特先生生活在了彼岸花开花的地方。 克莱仰慕自己叔叔的博学和勇武，曾经立志成为和彼特一样伟大的探险家。他提着剑，用了三十年克服外出的恐惧。他提着剑来到图书馆，又花了三十年才学懂所有的文字。他一边读着书一边练习着挥剑，转眼就过去了两三百年。他甚至开始学习起火铳和印刷。 又过去不知道多少年，他发现，自己还想要学习航海。他和杰克一起踏上了航海的征程。夜间有克莱占星，白天有克莱掌舵，遇险还有克莱战斗。但最后克莱离开的船队，瞎掉一只眼的杰克成为了无垠海上的海盗王。 克莱并不想要不能读书的航海船。他从书上学到了炼金术，他想成为一位炼金大师。 一位不知道多少岁数的炼金师，他的能力可想而知。在他的帮助下，来自孩儿巷的约翰靠着自己的头脑和克莱不计成本的炼金产品，成为了大商人，最后又成为了大银行家。可克莱并不在意这些，他并不理解用那些纸张和金属不断地转手究竟有什么意思——最重要的是，他希望手上还有其他的东西，如果每天都和钱币打交道，就提不起剑，也拿不动书了。 于是他在约翰的资助下，继续周游大陆。又过去很多年，来自孩儿巷的安妮开始跟随他。克莱向安妮讲解一本又一本典籍。安妮天资聪颖，总是很快就能理解克莱所讲解的知识。旅途中安妮也爱上了博学的克莱。 而安妮向克莱表白的那一天，也就是他们最后一面。 克莱并不想成为谁的情人，也不希望以后成为谁的父亲。他记得彼特叔叔失去妻子和儿子时的恸哭。他不想承担这些，因而离开了安妮。 彼时杰克已经去世，没有了克莱，安妮并没有能力横跨无垠海。 所以克莱回到了彼岸城。 过去无数岁月，克莱依旧是十三四岁时的模样。 而从那之后，孩儿巷里多出了一个身影，一个永远坐在彼岸花田中，眼神明亮却只会等着花开将花塞进嘴里的少年。他叫克莱。","link":"/2025/05/27/mytale01/"}],"tags":[{"name":"学术生活","slug":"学术生活","link":"/tags/%E5%AD%A6%E6%9C%AF%E7%94%9F%E6%B4%BB/"},{"name":"RNA sequence design","slug":"RNA-sequence-design","link":"/tags/RNA-sequence-design/"},{"name":"游戏人生","slug":"游戏人生","link":"/tags/%E6%B8%B8%E6%88%8F%E4%BA%BA%E7%94%9F/"},{"name":"胡咧传 - 人物特典","slug":"胡咧传-人物特典","link":"/tags/%E8%83%A1%E5%92%A7%E4%BC%A0-%E4%BA%BA%E7%89%A9%E7%89%B9%E5%85%B8/"},{"name":"胡咧传 - 人物特典 - 胡安 - 莫青","slug":"胡咧传-人物特典-胡安-莫青","link":"/tags/%E8%83%A1%E5%92%A7%E4%BC%A0-%E4%BA%BA%E7%89%A9%E7%89%B9%E5%85%B8-%E8%83%A1%E5%AE%89-%E8%8E%AB%E9%9D%92/"},{"name":"RNA inverse folding","slug":"RNA-inverse-folding","link":"/tags/RNA-inverse-folding/"},{"name":"我的童话","slug":"我的童话","link":"/tags/%E6%88%91%E7%9A%84%E7%AB%A5%E8%AF%9D/"}],"categories":[{"name":"科研","slug":"科研","link":"/categories/%E7%A7%91%E7%A0%94/"},{"name":"小说","slug":"小说","link":"/categories/%E5%B0%8F%E8%AF%B4/"}],"pages":[{"title":"","text":"个人简介 汜水剑南驿，倦枕潇湘择箬笠。朔北阮郎陌路，东海秋水太息。虽求冯虚舳舻东，洞箫声起，徒然咽泣。 梦得竹枝词，烟雨半城也无晴。清都妙法莲华，忘川范蠡散金。孑然一身朝问道，美人心移，夕死可矣。 我始终希望我的业余生活与工作，都始终做到，我声明、我执行、我承担。我想除了和拉康所主张的“与症候和解”外，还有这样的一种人生，那就是拒绝感知以内的一切割裂，做一根野草，随风摇摆，等待着不知名的野火焚灭，但永远平静。 在这个博客里面你大概能看到： 学术 生活 相声 漫评 游评 一个精神病 总之，欢迎你","link":"/about/index.html"},{"title":"","text":"","link":"/friend/index.html"},{"title":"","text":"欢迎来到第二个秋秋空间（留言板）","link":"/message/index.html"},{"title":"","text":"🎈🎈饕餮墙🎈🎈 饮食男女，人之大事","link":"/album/index.html"},{"title":"","text":"&nbsp;&nbsp;听听音乐 音乐播放器由mePlayer提供，布局参照网友博客所作，感谢作者的辛勤付出。更多音乐分享请查看歌单。 &nbsp;&nbsp;看看视频 ->点击以下条目开始播放视频,向下滑动查看更多","link":"/media/index.html"},{"title":"音乐歌单收藏","text":"温馨提示：选择喜欢的音乐双击播放，由于版权原因部分不能播放。如果喜欢歌单收藏一下，去网易云都能播放哟！","link":"/music/index.html"},{"title":"","text":"碎碎念 tips：github登录后按时间正序查看、可点赞加❤️、本插件地址…「+99次查看」 碎碎念加载中，请稍等... $.getScript(\"/js/gitalk_self.min.js\", function () { var gitalk = new Gitalk({ clientID: '46a9f3481b46ea0129d8', clientSecret: '79c7c9cb847e141757d7864453bcbf89f0655b24', id: '666666', repo: 'issue_database', owner: 'removeif', admin: \"removeif\", createIssueManually: true, distractionFreeMode: false }); gitalk.render('comment-container1'); });","link":"/self-talking/index.html"}]}