{"posts":[{"title":"RNA序列设计方法","text":"大纲、目录 大纲、目录 0. 前言 1. 中英文摘要 2. 背景综述 2.1 RNA计算设计任务 2.2 RNA计算设计方法及常见优化目标 2.2.1 代表性RNA设计方法 2.3 目前RNA计算设计方法的问题和缺陷 3. 研究目标 4. 实验设计及方法 4.1 RNA设计任务的分类和公式化描述 4.2 RNACG - 条件生成视角下的RNA序列设计框架 4.3 RNA三级结构特征的构建 5. 前期结果 5.1 RNA结构特征的构建和特征重要性 5.2 RNACG在RNA设计任务上的性能表现 5.3 基于二叉树的RNA二级结构表达方式及在Rfam上的聚类结果 6. 进一步研究计划 6.1 更广泛的RNA特征工程 6.2 更全面的条件引导生成 6.3 共转录折叠（动力学）视角下的序列生成过程控制 0. 前言 本篇部分承接RNADesign部分，核心是博主博资考书面报告部分内容的撰写。反正总要先写草稿，干脆写个博客。把不敏感的内容公布就是了。 1. 中英文摘要 待写 最不想写的就是这玩意儿。等我正文写完再说。 2. 背景综述 2.1 RNA计算设计任务 RNA作为承接DNA和蛋白质之间信息的流通中介，广泛参与转录、转移、酶促反应等众多生物过程。在工程上，许多基于RNA的生物学工具被应用于包括基因剪切、基因沉默、蛋白质定位等领域，为合成生物学、生物物理学和临床医学等学科提供有效的工具。因此，如何设计一个有效的RNA至关重要。 现有的RNA计算设计任务，通常面对以下任务中的一种或几种： 设计折叠成指定结构的RNA，这种任务通常基于结构决定功能的假设，例如一部分核糖适配体的设计，就认为具有指定口袋的结构可以结合对应的配体。 设计具有某种特定序列特异性的RNA，这种任务的假设更多来源于同源序列具有相似功能的假设，例如RfamGen就在协方差模型的基础上重建发射概率。 在某种约束下优化RNA的某种属性，例如在mRNA设计中通常会综合考虑密码子适配性和最小自由能结构的折叠自由能变化。 绝大多数的RNA设计任务都可以视作以上任务的综合，例如在茶碱调控的核糖开关中，研究者就将适配体的序列约束和形成开关结构的序列约束综合考虑，同时再考虑两种结构给定后的折叠自由能差值，将差值是否小于茶碱结合在适配体上的自由能变化作为采纳序列的标准，并成功设计出了多种更高效的茶碱型核糖开关。本章的后续章节将详细介绍现有的RNA计算设计方法。 2.2 RNA计算设计方法及常见优化目标 有一大类RNA设计，尤其是sRNA的设计，主要集中在序列特异性上，这包括设计特定核酸序列的互补序列、在已知的两段功能序列中插入可靠的linker或引入突变等。这样的设计在RNAi、siRNA、guide RNA的序列设计中非常常见。优化目标则包括没有脱靶位点、具有特定的碱基频率、避免过长的重复碱基等。这样的设计在对应的序列设计任务，尤其是短序列的设计任务上是卓有成效的。 而对于更长的RNA的设计，则依据任务目标和假设的不同，有了更多样的设计方法。 以mRNA设计为代表的设计方法，其关注的内容在于调控效率和序列约束。根据目标蛋白序列，mRNA的序列空间被限制在给定的密码子中。以LinearDesign为代表的mRNA序列设计方法目标就是尽可能加速在密码子约束下的mRNA序列搜索过程。同时，基于表达量与密码子适配性和最小折叠自由能的乘积正相关的假设，LinearDesign在优化过程中同时考虑序列的最小自由能结构，以期望获得平衡稳定性和单位时间表达量（或者说生物活性）的mRNA。此外另一部分人则关注调控mRNA的UTR区域序列的设计，期望找到对mRNA翻译效率影响最大的序列。后者则更多依赖可靠的基于序列的属性预测模型，生成模型当前在这类任务上还鲜有出现。 以可定量或半定量的性质描述作为RNA设计优化目标的设计任务，正如刚才所说，则多依赖于可靠的基于序列的预测模型，这包括但不限于RNA的热力学模型、基于RNA语言模型的下游性质预测模块等。这类设计更多时候还是类似于半经验的理性设计或者干实验上的筛选——前者包括人为的突变少量关键位点，后者则有包括随机突变、蒙特卡洛采样、遗传算法等方法，试图搜索和加速搜索更优的序列。 而对于结构，尤其是三级结构这个特殊的定量性质，则稍微有些不同。早期利用FARFAR2生成片段然后组装片段的方法与前文提到的干实验上做筛选比较一致，但近年来随着包括RhoFold，RosettafoldNA, DRFold等RNA结构预测方法，以及RDesign,Ribodiffusion等三级结构逆折叠方法的提出，基于结构的设计方法则开始涌现出直接预测的方法，而非传统的筛选加验证。对于这类模型，其优化目标一般有两类，一类是解出或者预测设计出的RNA序列的结构，判断这个结构和目标结构之间的相似性；另一类则是验证在只给定骨架坐标的情况下，模型根据真实结构设计的序列和原始序列的相似性。 还有一类RNA设计侧重在家族特异性上。这其中最重要的模型之一是协方差模型。Rfam数据就使用协方差模型，同时建模RNA的二级结构和序列的同源信息，从而判断一条RNA序列属于哪一个家族。协方差模型实际上是一个马尔科夫链，其节点状态被标记为未成对的核苷酸、成对的核苷酸、缺失核苷酸和插入核苷酸，并记录不同状态之间的转移概率。目前基于协方差模型定义的家族信息的RNA设计模型，其设计方法都是根据构建的协方差模型采样生成序列。 2.2.1 代表性RNA设计方法 对于半经验的设计方法，例如针对CRISPR的guide RNA设计，都有成熟的文库和商业化方案。在这里不再赘述。在这里主要介绍具有代表性的计算方法。 LinearDesign: 通过构建密码子规则和二级结构折叠规则约束下的语法树，加速对mRNA序列的优化和搜索； RfamGen: 借助VAE模型重构协方差模型中马尔科夫链之间的转移和发射概率，从而寻找更新颖的特定家族的RNA； RhoDesign: 借助Rhofold预测的大量高置信度的计算结构训练RNA逆折叠模型，然后针对特定的核酸适配体结构设计序列； UTR-LM: 借助大量的未标注数据训练了UTR区域序列的语言模型，并根据特定任务的实验数据微调下游模块，利用训练好的性质预测模块搜索具有目标特性的RNA序列 2.3 目前RNA计算设计方法的问题和缺陷 RNA计算设计方法所要面对的核心问题是过大的序列搜索空间和RNA的结构、性质、功能等注释数据和工具的稀缺。这些问题在类似siRNA的设计上并不显著，因为其有明确的碱基互补配对的约束，且序列也并不长，其搜索空间很小。但其他的设计任务则在这些问题上各有体现。对于逆折叠问题，二级结构的逆折叠通常通过检验对应的二级结构在指定的折叠规则和热力学参数下能不能折叠成目标结构，这就面临了过大的搜索空间的问题；而三级结构的逆折叠现有的评估方式则多是“序列回复率”，即预测的序列和作为输入的序列有多少核苷酸是相同的，这正是三级结构的数据稀缺使得没有像Alphafold这种性能足够的结构预测模型所导致的。 对于具有不同性质——例如UTR序列的翻译效率、mRNA的核糖体载量等——RNA的设计，也同样面临着数据量的问题。这方面，RNA语言模型的发展缓解了一些困难，利用大量的未标注的RNA序列进行预训练，再于不同的性质预测任务上进行微调，在包括结构预测、功能预测、性质预测上的众多预测任务上都提供了确实的增益。但设计任务这种偏向于生成任务的条件下，一个生成式模型显然比借助搜索算法加预测模型的范式更加直接，而除了逆折叠任务和RfamGen展示的家族特异性序列生成任务外，现在还没有类似ESM-IF，ProGen这样在蛋白质领域著有成效的生成模型。 除此之外，作为设计任务中重要且独特的一节，对于RNA的逆折叠任务——或者说设计具有指定三级结构RNA序列的任务，现有的工作对于深度学习领域中的新结构、新算法的关注度过高，而对基础的特征工程则挖掘不够。但对于RNA，尤其是和蛋白质互作的RNA，其结构和序列上的偏向性和single RNA显而易见是有差异的。从机器学习的角度上来说，single RNA类似将RNA序列作为唯一的条件，而complex的条件则包括了互作的其他分子，这样不同的条件必然会给RNA结构分布的条件概率带来偏移。这些信息还没有系统的被特征工程整理并检验，这也使得现在的基于三级结构的RNA设计乃至RNA的三级结构设计都相对盲目，是在“黑盒”中操作。 另一个未被考虑的问题则是动力学。转录终止过程中的共转录折叠已经通过解出结构得到证明，而共转录折叠作为转录过程——或者说生物体内的RNA结构形成的过程——最重要的动力学过程，对它的研究却严重不足。除了一些手动设置参数来可视化共转录折叠过程中的二级结构分布的工具外，共转录折叠的计算工具极少。此外还有一些搜索同一条RNA从A结构到B结构之间动力学势垒最小的路径的工具。考虑到包括核糖开关、转录终止子等的功能都依赖于结构的变化，怎么可靠的引入动力学的约束也是潜在的方向。 3. 研究目标 本课题主要面对两个问题： 构建RNA设计任务的统一描述和生成式框架，从而实现普适的、支持多目标优化的RNA设计模型 完善基于RNA三级结构的特征工程及解释性工作，寻找包括更精确的motif、基于结构特征的RNA家族聚类等 此外，对于生成式框架，探索基于动力学的生成过程控制 4. 实验设计及方法 4.1 RNA设计任务的分类和公式化描述 如第二节所述，RNA设计任务可以被分类为： 基于三级结构的RNA序列设计 基于序列特异性的RNA序列设计 对特定性质的RNA序列优化 形式化描述如下： 对于一个给定的目标C（结构、家族特异性、理化性质等）和指定的约束Σ，找到这样一条序列 S:={s∥s={A,C,G,U}} ，这条序列对应的性质C(S)与目标C足够接近，即 \\argminS∈ΣD(C(S),C)其中 D 是某种距离度量，例如对于三级结构，这个指标可以是RMSD,TM score等结构上常用来衡量序列相似性的指标（在这里对于TM score，距离度量应该换成1-TM score）；而对于优化目标，写作 minormaxC(S) 或许更合适，或者形式化将 C 记作 ∞。 4.2 RNACG - 条件生成视角下的RNA序列设计框架 4.3 RNA三级结构特征的构建 5. 前期结果 5.1 RNA结构特征的构建和特征重要性 5.2 RNACG在RNA设计任务上的性能表现 5.3 基于二叉树的RNA二级结构表达方式及在Rfam上的聚类结果 6. 进一步研究计划 6.1 更广泛的RNA特征工程 6.2 更全面的条件引导生成 6.3 共转录折叠（动力学）视角下的序列生成过程控制","link":"/2025/05/13/phdqfy/"},{"title":"RolePlayAI","text":"","link":"/2025/05/01/RolePlayAI/"},{"title":"About RNADesign (Always to be continued)","text":"0. 不定更新的前言 其实说是RNA设计问题，但多数内容其实针对整个生物序列设计问题。一些形式上的明确定义是需要的，至少能避免审稿人总是说看不懂Notation 1. RNA设计问题的形式化定义 RNA设计的核心目标是生成满足特定属性（如结构、功能或类型）的RNA序列。形式化表示如下： 给定目标属性 c∗（如特定结构、RNA类型或功能），RNA设计的目标是找到一个映射函数 f，使得生成的RNA序列 S 具有目标属性 c∗：∃f:c↦{S∈Σ∗∣S has property c∗} 在实际应用中，通常无法找到完全满足目标属性的序列 S，因此引入距离度量 D 来衡量生成序列与目标属性之间的差异，并重新定义优化目标：minS∈Σ∗D(c,c∗) 2. RNA序列的概率分布 RNA序列被表示为核苷酸字符串 S={si}i=1L，其中每个核苷酸 si∈{A,C,G,U}。序列的概率分布由以下公式给出： P(si|Σ∗)=∑ski=si;Sk∈Σ∗P(Sk|Σ∗)P(Sk|Σ∗)=∏iP(ski|Σ∗)∑Sj∈Σ∗∏iP(sji|Σ∗)最终的优化目标可以表示为： minE[D(c,c∗)]⟺min∑Sk∈Σ∗D(c,c∗)P(Sk|Σ∗)3. 参数化模型与距离度量 我们很容易意识到，设计问题的核心问题是怎么设计一个合适的距离度量。对于概率分布反而并不重要，采用连续性或者离散的方案都挺程式化，这个在后面具体聊可能的结构和实现的时候再讨论。现在先讨论距离度量。 3.1 逆折叠任务 首先比较好的连续性度量是三级结构之间的距离，例如最常见的是RMSD。此时的序列设计任务也是很经典的&quot;逆折叠任务&quot;，此时我们的设计任务被描述成 minSpredRMSD(Struct(Spred),Struct(Starget))问题变得很明确，即怎么获得从序列到结构S↦Struct的映射，在这里我们获得了几个变种： 限制搜索空间，都给我从已知的数据库里搜索，于是问题变成了minSpred∈ΣRMSD(Struct(Spred),Struct(Starget))where Σ is a known dataset, e.g., PDB这个问题就类似于某种向量搜索了，从不包含target的数据库中搜索结构和它最像的就行。考虑到RNA、DNA满打满算也就几千个结构数据，这个工作只能说至少现在意义不大LMAO 基于结构预测模型，我作为结构预测模型能搜索的空间是无限的！，于是问题变成了minSpredRMSD(PredStructθ(Spred),Struct(Starget))where PredStructθ is a structure predictor, e.g., AF3好吧，这里则涉及另一个问题，置信度的问题，RNA数据少，10W平方公里的土地上无限的搜索空间也认识不了几个人 第一性原理，序列像就是结构像！好吧，于是这个设计目标就更明确了minEStarget∈ΣRecovery(Spred,Starget)where Σ contains RNA with similar structure这也是现在最主流的基于三级结构设计序列的模型的训练方式，例如ProteinMPNN，这里的核心问题其实是连续性究竟有没有那么好——这指向另一个很有意思的设计目标，即设计出尽可能偏离已知序列但结构足够相似的序列。此处不作赘述，以后有空就测试 除了三级结构，还有二级结构的逆折叠，在这里我们只讨论RNA的二级结构，这是因为在核酸领域，基于碱基互补配对来定义二级结构的模式有明确的规则（配对方式及热力学参数），这比在蛋白质领域内实则是将三级结构的某些Motif截下作为二级结构的方式要清晰的多。 首先，我们存在一个规则集Ψ，其描述给定的二级结构下，RNA每个部分对折叠自由能的贡献，例如在最近邻模型下 ΔG(Pair(i,j)|S)=ΔG(Pair(i,j)|si−1,sj+1)总之，对于任意给定的核苷酸序列，我们原则上可以获得它所有可能的RNA结构以及对应的热力学能量，即 ΔG(Struct,S|Ψ)那么，多数时候，逆折叠问题显而易见的应该是 minSΔG(Struct,S|Ψ)但在这里存在一个问题，你指定的这个结构，是否是某一个可设计的结构，这个问题有很多定义，例如，这个结构到底是不是某一条序列的最低自由能结构，即 ∀S,∃Struct′≠Struct,ΔG′&lt;ΔG另一个问题则是，对于多条将制定结构作为最小自由能结构的序列，怎么评价哪条序列更优。当然，这个问题目前不做考虑，所有的逆折叠问题都认为你只要找到在指定规则集下能折叠成指定二级结构的序列，就算找到了解。 在这里我们似乎看到了一个清晰的强化学习图景，首先我们先规定一下符号，接下来我们会使用带数字的点括号式来描述二级结构，即 .i代表第i个核苷酸没有形成互补配对 (i)j代表第i个核苷酸和第j个核苷酸形成了互补配对 序列也采用类似的方式来定义，即 [ACGU]i代表第i个核苷酸是[ACGU] Action: .i↦{Ai,Ci,Gi,Ui}(i)j↦{AiUj,UiAj,CiGj,GiCj,GiUj,UiGj}State:","link":"/2025/04/24/RNADesign/"},{"title":"testblog","text":"不太明白到底怎么设计的page workflow","link":"/2025/04/24/testblog/"}],"tags":[{"name":"学术生活","slug":"学术生活","link":"/tags/%E5%AD%A6%E6%9C%AF%E7%94%9F%E6%B4%BB/"},{"name":"RNA sequence design","slug":"RNA-sequence-design","link":"/tags/RNA-sequence-design/"},{"name":"RNA inverse folding","slug":"RNA-inverse-folding","link":"/tags/RNA-inverse-folding/"},{"name":"游戏人生","slug":"游戏人生","link":"/tags/%E6%B8%B8%E6%88%8F%E4%BA%BA%E7%94%9F/"}],"categories":[],"pages":[{"title":"","text":"","link":"/friend/index.html"},{"title":"","text":"欢迎来到第二个秋秋空间（留言板）","link":"/message/index.html"},{"title":"","text":"&nbsp;&nbsp;听听音乐 音乐播放器由mePlayer提供，布局参照网友博客所作，感谢作者的辛勤付出。更多音乐分享请查看歌单。 &nbsp;&nbsp;看看视频 ->点击以下条目开始播放视频,向下滑动查看更多","link":"/media/index.html"},{"title":"","text":"🎈🎈饕餮墙🎈🎈 饮食男女，人之大事","link":"/album/index.html"},{"title":"","text":"个人简介 汜水剑南驿，倦枕潇湘择箬笠。朔北阮郎陌路，东海秋水太息。虽求冯虚舳舻东，洞箫声起，徒然咽泣。 梦得竹枝词，烟雨半城也无晴。清都妙法莲华，忘川范蠡散金。孑然一身朝问道，美人心移，夕死可矣。 我始终希望我的业余生活与工作，都始终做到，我声明、我执行、我承担。我想除了和拉康所主张的“与症候和解”外，还有这样的一种人生，那就是拒绝感知以内的一切割裂，做一根野草，随风摇摆，等待着不知名的野火焚灭，但永远平静。 在这个博客里面你大概能看到： 学术 生活 相声 漫评 游评 一个精神病 总之，欢迎你","link":"/about/index.html"},{"title":"音乐歌单收藏","text":"温馨提示：选择喜欢的音乐双击播放，由于版权原因部分不能播放。如果喜欢歌单收藏一下，去网易云都能播放哟！","link":"/music/index.html"},{"title":"","text":"碎碎念 tips：github登录后按时间正序查看、可点赞加❤️、本插件地址…「+99次查看」 碎碎念加载中，请稍等... $.getScript(\"/js/gitalk_self.min.js\", function () { var gitalk = new Gitalk({ clientID: '46a9f3481b46ea0129d8', clientSecret: '79c7c9cb847e141757d7864453bcbf89f0655b24', id: '666666', repo: 'issue_database', owner: 'removeif', admin: \"removeif\", createIssueManually: true, distractionFreeMode: false }); gitalk.render('comment-container1'); });","link":"/self-talking/index.html"}]}