{"posts":[{"title":"RNA序列设计方法","text":"大纲、目录 大纲、目录 0. 前言 1. 中英文摘要 2. 背景综述 2.1 RNA计算设计任务 2.2 RNA计算设计方法及常见优化目标 2.2.1 代表性RNA设计方法 2.3 目前RNA计算设计方法的问题和缺陷 3. 研究目标 4. 实验设计及方法 4.1 RNA设计任务的分类与公式化描述 4.2 RNACG - 条件生成视角下的RNA序列设计框架 4.3 RNA三级结构特征的构建 5. 前期结果 5.1 RNA结构特征的构建和特征重要性 5.2 RNACG在RNA设计任务上的性能表现 5.3 基于二叉树的RNA二级结构表达方式及在Rfam上的聚类结果 6. 进一步研究计划 6.1 更广泛的RNA特征工程 6.2 更全面的条件引导生成 6.3 共转录折叠（动力学）视角下的序列生成过程控制 0. 前言 本篇部分承接RNADesign部分，核心是博主博资考书面报告部分内容的撰写。反正总要先写草稿，干脆写个博客。把不敏感的内容公布就是了。 1. 中英文摘要 待写 最不想写的就是这玩意儿。等我正文写完再说。 2. 背景综述 RNA作为连接DNA与蛋白质之间信息传递的重要分子，在转录调控、转运过程、催化反应等多种生物过程中发挥着关键作用。近年来，随着合成生物学、结构生物学和计算生物学的发展，RNA工程已成为推动基因编辑、疾病治疗及功能研究的重要工具。因此，发展高效、精准的RNA计算设计方法，具有重要的理论价值和广泛的应用前景。 本章旨在系统梳理RNA计算设计的基本任务、代表性方法及其优化目标，并分析当前主流方法所面临的主要挑战与局限性，为后续提出新的RNA序列设计框架提供理论依据与问题导向。 2.1 RNA计算设计任务 RNA计算设计的核心目标是：根据特定功能需求或结构特征，反向推导出满足条件的RNA序列 。现有的RNA计算设计任务，通常面对以下任务中的一种或几种： 结构驱动型设计 ：即设计能够折叠成指定二级或三级结构的RNA序列。该任务基于“结构决定功能”的假设，例如核糖适配体的设计通常依赖于特定结合口袋的形成； 序列特异性设计 ：即设计具有特定序列特征的RNA，如互补序列、限制性酶切位点等。这类任务常用于siRNA、gRNA的设计，强调序列匹配与脱靶控制； 属性优化型设计 ：即在满足结构或序列约束的前提下，对某些物理化学性质进行优化，例如最小自由能（MFE）、密码子偏好性、翻译效率等。 绝大多数的RNA设计任务都可以视作以上任务的综合，以茶碱调控型核糖开关为例，研究人员综合考虑了适配体结构的稳定性、开关结构的转换自由能差值以及序列的热力学特性，从而设计出性能更优的响应元件。类似地，mRNA疫苗设计中也需同时优化密码子使用、结构稳定性和翻译效率。 在接下来的小节中，我们将系统回顾现有RNA计算设计方法的发展现状，并对其适用范围与局限性进行分析。 2.2 RNA计算设计方法及常见优化目标 RNA计算设计方法的发展经历了从经验规则驱动到数据驱动、再到深度学习建模的演进过程。根据设计目标和策略的不同，现有的方法可分为以下几类： 结构驱动型设计方法 此类方法主要面向RNA二级或三级结构的设计任务。早期方法多采用启发式搜索或片段组装策略，如FARFAR2通过生成局部结构片段并进行拼接来构建全RNA结构。近年来，随着RhoFold、RosettafoldNA、DRFold等高精度RNA结构预测模型的发展，基于结构的逆折叠方法（如RDesign、Ribodiffusion）开始兴起。这些方法直接从目标结构出发，生成与之匹配的RNA序列。 此类方法的优化目标通常包括： 设计序列的预测结构与目标结构之间的相似性； 在给定骨架坐标下，生成序列与原始序列的相似度（如“序列回复率”）； 确保生成序列在热力学上具有较高的折叠稳定性。 序列驱动型设计方法 对于短RNA（如siRNA、miRNA、gRNA）的设计任务，序列特异性成为核心关注点。此类方法通常基于碱基配对规则、脱靶效应评估模型等，优化目标包括： 最小化脱靶风险； 控制碱基频率分布； 避免重复序列或不稳定结构区域。 这类设计在RNAi、CRISPR-Cas系统等领域已实现高度自动化和商业化，面对不同任务甚至会有完备的高通量筛选后的文库 功能驱动型设计方法 部分RNA设计任务聚焦于功能性属性的优化，例如mRNA的翻译效率、UTR区域的调控能力等。这类方法通常依赖于序列属性预测模型，通过优化目标函数指导序列生成。例如： LinearDesign 方法在密码子选择和结构稳定性的双重约束下，快速搜索最优mRNA序列； UTR-LM 则借助语言模型预训练技术，微调后用于预测和优化UTR区域的功能表现。 此类任务仍面临数据稀缺和模型泛化能力不足的问题，尤其在生成式模型方面尚处于探索阶段。 家族特异性设计方法 协方差模型（Covariance Model, CM）是RNA家族建模的经典方法，广泛应用于Rfam数据库中的RNA分类与注释。CM不仅建模序列保守性，还捕捉二级结构信息，能够有效识别RNA家族成员。基于CM的RNA设计方法通常通过采样生成符合该模型的序列，以保持家族特异性 2.2.1 代表性RNA设计方法 对于半经验的设计方法，例如针对CRISPR的guide RNA设计，都有成熟的文库和商业化方案。在这里不再赘述。在这里主要介绍具有代表性的计算方法。 LinearDesign: 通过构建密码子规则和二级结构折叠规则约束下的语法树，加速对mRNA序列的优化和搜索； RfamGen: 借助VAE模型重构协方差模型中马尔科夫链之间的转移和发射概率，从而寻找更新颖的特定家族的RNA； RhoDesign: 借助Rhofold预测的大量高置信度的计算结构训练RNA逆折叠模型，然后针对特定的核酸适配体结构设计序列； UTR-LM: 借助大量的未标注数据训练了UTR区域序列的语言模型，并根据特定任务的实验数据微调下游模块，利用训练好的性质预测模块搜索具有目标特性的RNA序列 此外，还有大量基于搜索算法（如遗传算法、蒙特卡洛模拟）的传统方法仍在使用，尤其是在缺乏高质量生成模型的情况下。 2.3 目前RNA计算设计方法的问题和缺陷 尽管RNA计算设计方法在多个方向取得了进展，但仍存在若干亟待解决的关键问题： 序列空间过大导致搜索效率低下 RNA序列长度通常在几十至几千个核苷酸之间，其潜在序列空间呈指数级增长，使得穷举搜索不可行。即便引入结构或序列约束，搜索效率依然受限。尤其在二级结构逆折叠任务中，如何高效筛选出既能折叠为目标结构、又能满足其他功能约束的序列仍是难题。 注释数据与评估工具匮乏 高质量的RNA结构、功能和动力学数据相对稀缺，严重制约了深度学习模型的训练与验证。例如，在三级结构设计中，由于缺乏类似于AlphaFold的高性能预测工具，“序列回复率”仍是主流评估指标，难以反映真实功能表现。 生成模型发展滞后 与蛋白质领域相比，RNA领域的生成模型尚处于初级阶段。虽然已有部分工作尝试引入VAE、扩散模型等生成架构（如RfamGen、Ribodiffusion），但整体来看，尚未出现类似ESM-IF或ProGen级别的通用生成模型。这限制了RNA设计从“筛选+验证”向“端到端生成”的范式转变。 特征工程挖掘不足 RNA设计涉及复杂的序列-结构-功能关系，但目前的方法往往忽视了对关键特征的系统提取与建模。例如，RNA与蛋白质互作时，其结构偏好性可能与单体RNA存在差异；而在复合物环境中，RNA的结构分布也受到外部条件的影响。这些因素尚未被充分纳入特征工程中，导致模型预测偏差较大。 缺乏对动力学过程的建模 RNA在体内折叠并非静态过程，而是伴随转录进行的动态变化。共转录折叠（cotranscriptional folding）已被实验证实对RNA功能至关重要，但目前绝大多数设计方法仍基于静态结构假设。尽管已有少数工具尝试建模折叠路径和能量势垒，但整体而言，动力学约束仍未被系统整合进RNA设计流程中。 3. 研究目标 RNA计算设计旨在根据特定功能或结构需求，反向生成满足条件的RNA序列。当前方法在任务建模统一性、三级结构特征挖掘及动力学过程建模方面仍存在明显不足。针对这些问题，本研究提出以下两个核心目标： 构建统一的RNA设计任务描述框架与生成式模型 现有RNA设计任务形式多样，包括结构驱动型、功能优化型和家族特异性等，但缺乏统一的任务建模方式，限制了模型的泛化能力与多目标优化潜力。为此，本研究拟建立一个通用的任务描述体系，将不同设计目标形式化为可联合建模的输入条件，并基于此构建端到端的深度生成模型。 该模型应具备： 多模态输入支持（如结构、功能属性、家族信息）； 多目标联合优化能力； 可解释性接口，便于分析关键特征对生成结果的影响。 最终目标是实现一个适用于多种RNA设计场景的通用生成平台。 完善基于RNA三级结构的特征工程与解释性建模 目前RNA设计中对三级结构的利用尚不充分，特征表示粗糙，缺乏对motif识别与家族聚类的有效建模。为此，本研究将进一步探索： 更具表达能力的三级结构特征提取方法； 基于结构的功能motif识别与注释； 利用结构特征进行RNA家族划分与聚类分析。 通过上述工作，提升模型对RNA结构-功能关系的理解能力，增强设计结果的生物学合理性。 此外，本研究会在生成模型的过程中，探索基于动力学的生成控制机制，RNA在细胞内的折叠是一个动态过程，受到共转录折叠等机制影响。然而，现有设计方法普遍忽略动力学因素。因此，本研究还将初步尝试在生成过程中引入动力学建模，探索更加贴近生物现实的序列生成策略。 4. 实验设计及方法 4.1 RNA设计任务的分类与公式化描述 如前所述（见2.1节），RNA计算设计任务可根据其核心目标划分为以下三类： 基于三级结构的设计：生成能够折叠为目标三维结构的RNA序列； 基于序列特异性的设计：满足特定序列模式或家族特异性要求； 基于性质优化的设计：在给定约束下最大化或最小化某些理化或功能属性（如翻译效率、折叠自由能等）。 上述任务可统一形式化为如下优化问题： 给定目标条件 $ C $（如目标结构、功能属性或家族特征）与序列约束集合 $ \\Sigma $，寻找一条RNA序列 $ S = {s_i} $，其中 $ s_i \\in {A, C, G, U} $，使得该序列在所定义的目标空间中与 $ C $ 尽可能匹配： argminS∈Σ⁡D(C(S),C)其中： $ C(S) $ 表示由序列 $ S $ 推导出的目标属性（例如预测结构、理化性质等）； $ \\mathcal{D}(\\cdot,\\cdot) $ 是衡量目标匹配程度的距离函数，具体形式依据任务类型而定： 对于结构设计任务，$ \\mathcal{D} $ 可采用 RMSD 或 TM-score（此时定义为 $ 1 - \\text{TM-score} $）； 对于性质优化任务，可直接定义为最大化或最小化目标函数 $ C(S) $。 该形式化建模为后续构建通用RNA设计框架提供了理论基础。 4.2 RNACG - 条件生成视角下的RNA序列设计框架 4.3 RNA三级结构特征的构建 5. 前期结果 5.1 RNA结构特征的构建和特征重要性 5.2 RNACG在RNA设计任务上的性能表现 5.3 基于二叉树的RNA二级结构表达方式及在Rfam上的聚类结果 6. 进一步研究计划 6.1 更广泛的RNA特征工程 6.2 更全面的条件引导生成 6.3 共转录折叠（动力学）视角下的序列生成过程控制","link":"/2025/05/13/phdqfy/"},{"title":"RolePlayAI","text":"","link":"/2025/05/01/RolePlayAI/"},{"title":"About RNADesign (Always to be continued)","text":"0. 不定更新的前言 其实说是RNA设计问题，但多数内容其实针对整个生物序列设计问题。一些形式上的明确定义是需要的，至少能避免审稿人总是说看不懂Notation 1. RNA设计问题的形式化定义 RNA设计的核心目标是生成满足特定属性（如结构、功能或类型）的RNA序列。形式化表示如下： 给定目标属性 c∗（如特定结构、RNA类型或功能），RNA设计的目标是找到一个映射函数 f，使得生成的RNA序列 S 具有目标属性 c∗：∃f:c↦{S∈Σ∗∣S has property c∗} 在实际应用中，通常无法找到完全满足目标属性的序列 S，因此引入距离度量 D 来衡量生成序列与目标属性之间的差异，并重新定义优化目标：minS∈Σ∗D(c,c∗) 2. RNA序列的概率分布 RNA序列被表示为核苷酸字符串 S={si}i=1L，其中每个核苷酸 si∈{A,C,G,U}。序列的概率分布由以下公式给出： P(si|Σ∗)=∑ski=si;Sk∈Σ∗P(Sk|Σ∗)P(Sk|Σ∗)=∏iP(ski|Σ∗)∑Sj∈Σ∗∏iP(sji|Σ∗)最终的优化目标可以表示为： minE[D(c,c∗)]⟺min∑Sk∈Σ∗D(c,c∗)P(Sk|Σ∗)3. 参数化模型与距离度量 我们很容易意识到，设计问题的核心问题是怎么设计一个合适的距离度量。对于概率分布反而并不重要，采用连续性或者离散的方案都挺程式化，这个在后面具体聊可能的结构和实现的时候再讨论。现在先讨论距离度量。 3.1 逆折叠任务 首先比较好的连续性度量是三级结构之间的距离，例如最常见的是RMSD。此时的序列设计任务也是很经典的&quot;逆折叠任务&quot;，此时我们的设计任务被描述成 minSpredRMSD(Struct(Spred),Struct(Starget))问题变得很明确，即怎么获得从序列到结构S↦Struct的映射，在这里我们获得了几个变种： 限制搜索空间，都给我从已知的数据库里搜索，于是问题变成了minSpred∈ΣRMSD(Struct(Spred),Struct(Starget))where Σ is a known dataset, e.g., PDB这个问题就类似于某种向量搜索了，从不包含target的数据库中搜索结构和它最像的就行。考虑到RNA、DNA满打满算也就几千个结构数据，这个工作只能说至少现在意义不大LMAO 基于结构预测模型，我作为结构预测模型能搜索的空间是无限的！，于是问题变成了minSpredRMSD(PredStructθ(Spred),Struct(Starget))where PredStructθ is a structure predictor, e.g., AF3好吧，这里则涉及另一个问题，置信度的问题，RNA数据少，10W平方公里的土地上无限的搜索空间也认识不了几个人 第一性原理，序列像就是结构像！好吧，于是这个设计目标就更明确了minEStarget∈ΣRecovery(Spred,Starget)where Σ contains RNA with similar structure这也是现在最主流的基于三级结构设计序列的模型的训练方式，例如ProteinMPNN，这里的核心问题其实是连续性究竟有没有那么好——这指向另一个很有意思的设计目标，即设计出尽可能偏离已知序列但结构足够相似的序列。此处不作赘述，以后有空就测试 除了三级结构，还有二级结构的逆折叠，在这里我们只讨论RNA的二级结构，这是因为在核酸领域，基于碱基互补配对来定义二级结构的模式有明确的规则（配对方式及热力学参数），这比在蛋白质领域内实则是将三级结构的某些Motif截下作为二级结构的方式要清晰的多。 首先，我们存在一个规则集Ψ，其描述给定的二级结构下，RNA每个部分对折叠自由能的贡献，例如在最近邻模型下 ΔG(Pair(i,j)|S)=ΔG(Pair(i,j)|si−1,sj+1)总之，对于任意给定的核苷酸序列，我们原则上可以获得它所有可能的RNA结构以及对应的热力学能量，即 ΔG(Struct,S|Ψ)那么，多数时候，逆折叠问题显而易见的应该是 minSΔG(Struct,S|Ψ)但在这里存在一个问题，你指定的这个结构，是否是某一个可设计的结构，这个问题有很多定义，例如，这个结构到底是不是某一条序列的最低自由能结构，即 ∀S,∃Struct′≠Struct,ΔG′&lt;ΔG另一个问题则是，对于多条将制定结构作为最小自由能结构的序列，怎么评价哪条序列更优。当然，这个问题目前不做考虑，所有的逆折叠问题都认为你只要找到在指定规则集下能折叠成指定二级结构的序列，就算找到了解。 在这里我们似乎看到了一个清晰的强化学习图景，首先我们先规定一下符号，接下来我们会使用带数字的点括号式来描述二级结构，即 .i代表第i个核苷酸没有形成互补配对 (i)j代表第i个核苷酸和第j个核苷酸形成了互补配对 序列也采用类似的方式来定义，即 [ACGU]i代表第i个核苷酸是[ACGU] Action: .i↦{Ai,Ci,Gi,Ui}(i)j↦{AiUj,UiAj,CiGj,GiCj,GiUj,UiGj}State:","link":"/2025/04/24/RNADesign/"},{"title":"testblog","text":"不太明白到底怎么设计的page workflow","link":"/2025/04/24/testblog/"}],"tags":[{"name":"学术生活","slug":"学术生活","link":"/tags/%E5%AD%A6%E6%9C%AF%E7%94%9F%E6%B4%BB/"},{"name":"RNA sequence design","slug":"RNA-sequence-design","link":"/tags/RNA-sequence-design/"},{"name":"RNA inverse folding","slug":"RNA-inverse-folding","link":"/tags/RNA-inverse-folding/"},{"name":"游戏人生","slug":"游戏人生","link":"/tags/%E6%B8%B8%E6%88%8F%E4%BA%BA%E7%94%9F/"}],"categories":[],"pages":[{"title":"","text":"","link":"/friend/index.html"},{"title":"","text":"欢迎来到第二个秋秋空间（留言板）","link":"/message/index.html"},{"title":"","text":"&nbsp;&nbsp;听听音乐 音乐播放器由mePlayer提供，布局参照网友博客所作，感谢作者的辛勤付出。更多音乐分享请查看歌单。 &nbsp;&nbsp;看看视频 ->点击以下条目开始播放视频,向下滑动查看更多","link":"/media/index.html"},{"title":"","text":"🎈🎈饕餮墙🎈🎈 饮食男女，人之大事","link":"/album/index.html"},{"title":"","text":"个人简介 汜水剑南驿，倦枕潇湘择箬笠。朔北阮郎陌路，东海秋水太息。虽求冯虚舳舻东，洞箫声起，徒然咽泣。 梦得竹枝词，烟雨半城也无晴。清都妙法莲华，忘川范蠡散金。孑然一身朝问道，美人心移，夕死可矣。 我始终希望我的业余生活与工作，都始终做到，我声明、我执行、我承担。我想除了和拉康所主张的“与症候和解”外，还有这样的一种人生，那就是拒绝感知以内的一切割裂，做一根野草，随风摇摆，等待着不知名的野火焚灭，但永远平静。 在这个博客里面你大概能看到： 学术 生活 相声 漫评 游评 一个精神病 总之，欢迎你","link":"/about/index.html"},{"title":"音乐歌单收藏","text":"温馨提示：选择喜欢的音乐双击播放，由于版权原因部分不能播放。如果喜欢歌单收藏一下，去网易云都能播放哟！","link":"/music/index.html"},{"title":"","text":"碎碎念 tips：github登录后按时间正序查看、可点赞加❤️、本插件地址…「+99次查看」 碎碎念加载中，请稍等... $.getScript(\"/js/gitalk_self.min.js\", function () { var gitalk = new Gitalk({ clientID: '46a9f3481b46ea0129d8', clientSecret: '79c7c9cb847e141757d7864453bcbf89f0655b24', id: '666666', repo: 'issue_database', owner: 'removeif', admin: \"removeif\", createIssueManually: true, distractionFreeMode: false }); gitalk.render('comment-container1'); });","link":"/self-talking/index.html"}]}